// Angular
// https://angular.io/quick-start
// что необходимо знать и понимать что бы работать с Angular:
// - Node.js
// - TypeScript
// - Webpack
// - MVC pottern - шаблон проектирования для приложения 
// - Сам Angular (документация: https://angular.io/quick-start)
// сам ангуляр по сровнению с другими посложнее


//React 
// https://ru.reactjs.org
// перспективы те же что и Angular
// что необходимо знать и понимать что бы работать с React:
// - JSX
// - Babel - сейчас React в реакт JSX компилируется при помощи Babel
// - Webpack
// - Сам React (документация: https://ru.reactjs.org)


//Vue.js
// https://vuejs.org
// довольно прост 
// что необходимо знать и понимать что бы работать с Vue:
// - Webpack
// - Сам Vue (документация: https://vuejs.org)

//Вывод - все это инструменты которы неписаны на js для работы над определенной задачей

// Если хотите заглулить какието вещи или не заморачиватся а брать какой-то инсструмент
// работать на каких-то крупномасштабных проектах которые будут разростатся то Angular это ваш выбор
// именно для этого и создан такой фрайм ворк что бы поддерживать такие большие и сложные приложение
//которые разростаются

// если же вы цените гибкость и настройку под себя под скорость роботы любите писать все на чистом
// js и не боитесь его смешиватьс html то React всегда рад вам

// Ну а если вы хотите легко и быстро научится писать чистый красивый код использовать легковестный 
// инструмент то  с Vue вам по пути